; domain
(define (domain room-duster)

    (:requirements :typing :negative-preconditions)

    (:types
        robot
        room
    )

    (:predicates
        (at ?r - robot ?p - room)
        (dirty ?p - room)
        (clean ?p - room)
    )

    (:action move
        :parameters (
            ?r - robot
            ?from - room
            ?to - room
        )
        :precondition 
            (at ?r ?from)
        
        :effect 
            (and
                (not (at ?r ?from))
                (at ?r ?to)
            )
    )
    (:action clean
        :parameters (
            ?r - robot
            ?p - room
        )
        :precondition
            (and
                (at ?r ?p)
                (dirty ?p)
                (not (clean ?p))
            )
        :effect
            (and
                (not (dirty ?p))
                (clean ?p)
            )
    )

)

; problem
(define (problem clean-rooms)
    (:domain room-duster)

    (:objects
        odkurzacz - robot
        pokoj1 pokoj2 pokoj3 - room
    )

    (:init
        (at odkurzacz pokoj1)
        (dirty pokoj1)
        (dirty pokoj2)
        (dirty pokoj3)
    )

    (:goal
        (and
            (clean pokoj1)
            (clean pokoj2)
            (clean pokoj3)
        )
    )
)

; plan
1. (clean odkurzacz pokoj1)
   deleted: (dirty pokoj1)
   added: (clean pokoj1)
   goals met: 1 of 3
2. (move odkurzacz pokoj1 pokoj3)
   deleted: (at odkurzacz pokoj1)
   added: (at odkurzacz pokoj3)
   goals met: 1 of 3
3. (clean odkurzacz pokoj3)
   deleted: (dirty pokoj3)
   added: (clean pokoj3)
   goals met: 2 of 3
4. (move odkurzacz pokoj3 pokoj2)
   deleted: (at odkurzacz pokoj3)
   added: (at odkurzacz pokoj2)
   goals met: 2 of 3
5. (clean odkurzacz pokoj2)
   deleted: (dirty pokoj2)
   added: (clean pokoj2)
   goals met: 3 of 3
